apache/nuttx/arch/arm/src/lpc11xx/hardware/lpc11_syscon.h
/********************************************************************************************
 * arch/arm/src/lpc11xx/hardware/lpc11_syscon.h
 *
 *   Copyright (C) 2010, 2013 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC11XX_HARDWARE_LPC11_SYSCON_H
#define __ARCH_ARM_SRC_LPC11XX_HARDWARE_LPC11_SYSCON_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "hardware/lpc11_memorymap.h"

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/

/* Register offsets *************************************************************************/

#define LPC11_SYSCON_SYSMEMREMAP_OFFSET       0x0000 /* System memory remap */
#define LPC11_SYSCON_PRESETCTRL_OFFSET        0x0004 /* Pefipheral reset control */
#define LPC11_SYSCON_SYSPLLCTRL_OFFSET        0x0008 /* System PLL control */
#define LPC11_SYSCON_SYSPLLSTAT_OFFSET        0x000C /* System PLL status */
                                                     /* 0x010 - 0x01c: Reserved */

#define LPC11_SYSCON_SYSOSCCTRL_OFFSET        0x0020 /* System oscillator control */
#define LPC11_SYSCON_WDTOSCCTRL_OFFSET        0x0024 /* Watchdog oscillator control */
#define LPC11_SYSCON_IRCCTRL_OFFSET           0x0028 /* IRC control */
                                                     /* 0x02c: Reserved */

#define LPC11_SYSCON_SYSRSTSTAT_OFFSET        0x0030 /* System reset status register */
                                                     /* 0x034 - 0x03c: Reserved */

#define LPC11_SYSCON_SYSPLLCLKSEL_OFFSET      0x0040 /* System PLL clock source select */
#define LPC11_SYSCON_SYSPLLCLKUEN_OFFSET      0x0044 /* System PLL clock source update enable */
                                                     /* 0x048 - 0x06c: Reserved */

#define LPC11_SYSCON_MAINCLKSEL_OFFSET        0x0070 /* Main clock source select */
#define LPC11_SYSCON_MAINCLKUEN_OFFSET        0x0074 /* Main clock source update enable */
#define LPC11_SYSCON_SYSAHBCLKDIV_OFFSET      0x0078 /* System AHB clock divider */
                                                     /* 0x07c: Reserved */

#define LPC11_SYSCON_SYSAHBCLKCTRL_OFFSET     0x0080 /* System AHB clock control */
                                                     /* 0x084 - 0x090: Reserved */

#define LPC11_SYSCON_SSP0CLKDIV_OFFSET        0x0094 /* SPI0 clock divider */
#define LPC11_SYSCON_UARTCLKDIV_OFFSET        0x0098 /* UART clock divider */
#define LPC11_SYSCON_SSP1CLKDIV_OFFSET        0x009c /* SPI1 clock divider */
                                                     /* 0x0a0 - 0x0cc: Reserved */

#define LPC11_SYSCON_WDTCLKSEL_OFFSET         0x00d0 /* WDT clock source select */
#define LPC11_SYSCON_WDTCLKUEN_OFFSET         0x00d4 /* WDT clock source update enable */
#define LPC11_SYSCON_WDTCLKDIV_OFFSET         0x00d8 /* WDT clock divider */
                                                     /* 0x0dc: Reserved */

#define LPC11_SYSCON_CLKOUTCLKSEL_OFFSET      0x00e0 /* CLKOUT clock source select */
#define LPC11_SYSCON_CLKOUTUEN_OFFSET         0x00e4 /* CLKOUT clock source update enable */
#define LPC11_SYSCON_CLKOUTCLKDIV_OFFSET      0x00e8 /* CLKOUT clock divider */
                                                     /* 0x0ec - 0x0fc: Reserved */

#define LPC11_SYSCON_PIOPORCAP0_OFFSET        0x0100 /* POR captured PIO status 0 */
#define LPC11_SYSCON_PIOPORCAP1_OFFSET        0x0104 /* POR captured PIO status 1 */
                                                     /* 0x108 - 0x14c: Reserved */

#define LPC11_SYSCON_BODCTRL_OFFSET           0x0150 /* BOD control */
#define LPC11_SYSCON_SYSTCKCAL_OFFSET         0x0154 /* System tick counter calibration */
                                                     /* 0x158 - 0x16c: Reserved */

#define LPC11_SYSCON_IRQLATENCY_OFFSET        0x0170 /* IRQ delay */
#define LPC11_SYSCON_NMISRC_OFFSET            0x0174 /* NMI source selection */
                                                     /* 0x178 - 0x1fc: Reserved */

#define LPC11_SYSCON_STARTAPRP0_OFFSET        0x0200 /* Start logic edge control register 0 */
#define LPC11_SYSCON_STARTERP0_OFFSET         0x0204 /* Start logic signal enable register 0 */
#define LPC11_SYSCON_STARTRSRP0CLR_OFFSET     0x0208 /* Start logic reset register 0 */
#define LPC11_SYSCON_STARTSRP0_OFFSET         0x020c /* Start logic status register 0 */
                                                     /* 0x210 - 0x22c: Reserved */

#define LPC11_SYSCON_PDSLEEPCFG_OFFSET        0x0230 /* Power-down states in Deep-sleep mode */
#define LPC11_SYSCON_PDAWAKECFG_OFFSET        0x0234 /* Power-down states after wake-up from Deep-sleep mode */
#define LPC11_SYSCON_PDRUNCFG_OFFSET          0x0238 /* Power-down configuration register */
                                                     /* 0x023c - 0x3f0: Reserved */
#define LPC11_SYSCON_DEVICE_ID_OFFSET         0x03f4 /* Device ID register 0 for parts LPC1100, LPC1100C, LPC1100L */


/* Register addresses ***********************************************************************/

#define LPC11_SYSCON_SYSMEMREMAP              (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSMEMREMAP_OFFSET)

#define LPC11_SYSCON_PRESETCTRL               (LPC11_SYSCON_BASE + LPC11_SYSCON_PRESETCTRL_OFFSET)
#define LPC11_SYSCON_SYSPLLCTRL               (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSPLLCTRL_OFFSET)
#define LPC11_SYSCON_SYSPLLSTAT               (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSPLLSTAT_OFFSET)

#define LPC11_SYSCON_SYSOSCCTRL               (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSOSCCTRL_OFFSET)
#define LPC11_SYSCON_WDTOSCCTRL               (LPC11_SYSCON_BASE + LPC11_SYSCON_WDTOSCCTRL_OFFSET)
#define LPC11_SYSCON_IRCCTRL                  (LPC11_SYSCON_BASE + LPC11_SYSCON_IRCCTRL_OFFSET)

#define LPC11_SYSCON_SYSRSTSTAT               (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSRSTSTAT_OFFSET)

