apache/nuttx/arch/arm/src/lpc11xx/hardware/lpc11_syscon.h
#define LPC11_SYSCON_SYSPLLCLKSEL             (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSPLLCLKSEL_OFFSET)
#define LPC11_SYSCON_SYSPLLCLKUEN             (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSPLLCLKUEN_OFFSET)

#define LPC11_SYSCON_MAINCLKSEL               (LPC11_SYSCON_BASE + LPC11_SYSCON_MAINCLKSEL_OFFSET)
#define LPC11_SYSCON_MAINCLKUEN               (LPC11_SYSCON_BASE + LPC11_SYSCON_MAINCLKUEN_OFFSET)

#define LPC11_SYSCON_SYSAHBCLKDIV             (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSAHBCLKDIV_OFFSET)
#define LPC11_SYSCON_SYSAHBCLKCTRL            (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSAHBCLKCTRL_OFFSET)

#define LPC11_SYSCON_SSP0CLKDIV               (LPC11_SYSCON_BASE + LPC11_SYSCON_SSP0CLKDIV_OFFSET)
#define LPC11_SYSCON_UARTCLKDIV               (LPC11_SYSCON_BASE + LPC11_SYSCON_UARTCLKDIV_OFFSET)
#define LPC11_SYSCON_SSP1CLKDIV               (LPC11_SYSCON_BASE + LPC11_SYSCON_SSP1CLKDIV_OFFSET)

#define LPC11_SYSCON_WDTCLKSEL                (LPC11_SYSCON_BASE + LPC11_SYSCON_WDTCLKSEL_OFFSET)
#define LPC11_SYSCON_WDTCLKUEN                (LPC11_SYSCON_BASE + LPC11_SYSCON_WDTCLKUEN_OFFSET)
#define LPC11_SYSCON_WDTCLKDIV                (LPC11_SYSCON_BASE + LPC11_SYSCON_WDTCLKDIV_OFFSET)

#define LPC11_SYSCON_CLKOUTCLKSEL             (LPC11_SYSCON_BASE + LPC11_SYSCON_CLKOUTCLKSEL_OFFSET)
#define LPC11_SYSCON_CLKOUTUEN                (LPC11_SYSCON_BASE + LPC11_SYSCON_CLKOUTUEN_OFFSET_OFFSET)
#define LPC11_SYSCON_CLKOUTCLKDIV             (LPC11_SYSCON_BASE + LPC11_SYSCON_CLKOUTCLKDIV_OFFSET)

#define LPC11_SYSCON_PIOPORCAP0               (LPC11_SYSCON_BASE + LPC11_SYSCON_PIOPORCAP0_OFFSET)
#define LPC11_SYSCON_PIOPORCAP1               (LPC11_SYSCON_BASE + LPC11_SYSCON_PIOPORCAP1_OFFSET)

#define LPC11_SYSCON_BODCTRL                  (LPC11_SYSCON_BASE + LPC11_SYSCON_BODCTRL_OFFSET)
#define LPC11_SYSCON_SYSTCKCAL                (LPC11_SYSCON_BASE + LPC11_SYSCON_SYSTCKCAL_OFFSET)

#define LPC11_SYSCON_IRQLATENCY               (LPC11_SYSCON_BASE + LPC11_SYSCON_IRQLATENCY_OFFSET)
#define LPC11_SYSCON_NMISRC                   (LPC11_SYSCON_BASE + LPC11_SYSCON_NMISRC_OFFSET)

#define LPC11_SYSCON_STARTAPRP0               (LPC11_SYSCON_BASE + LPC11_SYSCON_STARTAPRP0_OFFSET)
#define LPC11_SYSCON_STARTERP0                (LPC11_SYSCON_BASE + LPC11_SYSCON_STARTERP0_OFFSET)
#define LPC11_SYSCON_STARTRSRP0CLR            (LPC11_SYSCON_BASE + LPC11_SYSCON_STARTRSRP0CLR_OFFSET)
#define LPC11_SYSCON_STARTSRP0                (LPC11_SYSCON_BASE + LPC11_SYSCON_STARTSRP0_OFFSET)

#define LPC11_SYSCON_PDSLEEPCFG               (LPC11_SYSCON_BASE + LPC11_SYSCON_PDSLEEPCFG_OFFSET)
#define LPC11_SYSCON_PDAWAKECFG               (LPC11_SYSCON_BASE + LPC11_SYSCON_PDAWAKECFG_OFFSET)
#define LPC11_SYSCON_PDRUNCFG                 (LPC11_SYSCON_BASE + LPC11_SYSCON_PDRUNCFG_OFFSET)

#define LPC11_SYSCON_DEVICE_ID                (LPC11_SYSCON_BASE + LPC11_SYSCON_DEVICE_ID_OFFSET)

/* Register bit definitions *****************************************************************/

#define SYSCON_SYSMEMREMAP_MAP_SHIFT          (0)       /* Bits 0-1: System memory remap register */
#define SYSCON_SYSMEMREMAP_MAP_MASK           (3 << SYSCON_SYSMEMREMAP_MAP_SHIFT)
#  define SYSCON_SYSMEMREMAP_MAP_BOOTLOADER   (0 << SYSCON_SYSMEMREMAP_MAP_SHIFT) /* Interrupt vectors are re-mapped to Boot ROM */
#  define SYSCON_SYSMEMREMAP_MAP_RAM          (1 << SYSCON_SYSMEMREMAP_MAP_SHIFT) /* Interrupt vectors are re-mapped to Static RAM */
#  define SYSCON_SYSMEMREMAP_MAP_FLASH        (2 << SYSCON_SYSMEMREMAP_MAP_SHIFT) /* Interrupt vectors are keeped in flash */
                                                                                  /* Bits 2-31:  Reserved */

#define SYSCON_PRESETCTRL_SSP0_RST_N          (1 << 0)  /* SPI0 reset control */
#define SYSCON_PRESETCTRL_I2C0_RST_N          (1 << 1)  /* I2C0 reset control */
#define SYSCON_PRESETCTRL_SSP1_RST_N          (1 << 2)  /* SPI1 reset control */
#define SYSCON_PRESETCTRL_CAN_RST_N           (1 << 3)  /* C_CAN reset control */
                                                        /* Bits 4-31:  Reserved */

#define SYSCON_SYSPLLCTRL_MSEL_SHIFT          (0)       /* Bits 0-4: Feedback divider value. */
#define SYSCON_SYSPLLCTRL_MSEL_MASK           (0x1f << SYSCON_SYSPLLCTRL_MSEL_SHIFT)
#  define SYSCON_SYSPLLCTRL_MSEL_DIV(n)       ((n-1) << SYSCON_SYSPLLCTRL_MSEL_SHIFT) /* n=1,2,3,..32 */
#define SYSCON_SYSPLLCTRL_PSEL_SHIFT          (5)       /* Bits 5-6: Post divider ratio P. The division ratio is 2 x P */
#define SYSCON_SYSPLLCTRL_PSEL_MASK           (3 << SYSCON_SYSPLLCTRL_PSEL_SHIFT)
#  define SYSCON_SYSPLLCTRL_PSEL_DIV1         (0 << SYSCON_SYSPLLCTRL_PSEL_SHIFT)
#  define SYSCON_SYSPLLCTRL_PSEL_DIV2         (1 << SYSCON_SYSPLLCTRL_PSEL_SHIFT)
#  define SYSCON_SYSPLLCTRL_PSEL_DIV4         (2 << SYSCON_SYSPLLCTRL_PSEL_SHIFT)
#  define SYSCON_SYSPLLCTRL_PSEL_DIV8         (3 << SYSCON_SYSPLLCTRL_PSEL_SHIFT)
                                                                                  /* Bits 7-31:  Reserved */

#define SYSCON_SYSPLLSTAT_LOCK                (1 << 0)  /* PLL lock status. 0 = PLL not locked, 1 = PLL locked */
                                                        /* Bits 1-31: Reserved */

#define SYSCON_SYSOSCCTRL_BYPASS              (1 << 0)  /* Bypass system oscillator */
#define SYSCON_SYSOSCCTRL_FREQRANGE           (1 << 1)  /* Determines freq. range for low-power oscillator */
                                                        /* Bits 2-31: Reserved */
#define SYSCON_WDTOSCCTRL_DIVSEL_SHIFT        (0)       /* Bits 0-4: Select divider for Fclkana. wdt_osc_clk = Fclkana/(2x(1+DIVSEL)) */
#define SYSCON_WDTOSCCTRL_DIVSEL_MASK         (0x1f << SYSCON_WDTOSCCTRL_DIVSEL_SHIFT)
#  define SYSCON_WDTOSCCTRL_DIVSEL(n)         (((n-2)/2) << SYSCON_WDTOSCCTRL_DIVSEL_SHIFT) /* n = 2,4,8,..64 */
#define SYSCON_WDTOSCCTRL_FREQSEL_SHIFT       (5)       /* Bits 5-8: Select watchdog oscillator analog output frequency */
#define SYSCON_WDTOSCCTRL_FREQSEL_MASK        (15 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT)
#  define SYSCON_WDTOSCCTRL_FREQSEL_0p6Mhz    (1 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 0.6 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_1p05Mhz   (2 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 1.05 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_1p4Mhz    (3 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 1.4 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_1p75Mhz   (4 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 1.75 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_2p1Mhz    (5 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 2.1 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_2p4Mhz    (6 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 2.4 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_2p7Mhz    (7 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 2.7 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_3Mhz      (8 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 3.0 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_3p25Mhz   (9 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 3.25 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_3p5Mhz    (10 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 3.5 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_3p75Mhz   (11 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 3.75 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_4Mhz      (12 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 4 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_4p2Mhz    (13 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 4.2 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_4p4Mhz    (14 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 4.4 MHz */
#  define SYSCON_WDTOSCCTRL_FREQSEL_4p6Mhz    (15 << SYSCON_WDTOSCCTRL_FREQSEL_SHIFT) /* Select watchdog osc analog freq 4.6 MHz */
                                                                                      /* Bits 9-31: Reserved */

#define SYSCON_IRCCTRL_TRIM_MASK              (0xff)    /* Bits 0-7: Trim value used to adjust on-chip 12 MHz oscillator */
                                                        /* Bits 8-31: Reserved */

#define SYSCON_SYSRSTSTAT_POR                 (1 << 0)  /* POR reset status */
#define SYSCON_SYSRSTSTAT_EXTRST              (1 << 1)  /* Status of the external /RESET pin */
#define SYSCON_SYSRSTSTAT_WDT                 (1 << 2)  /* Status of the Watchdog reset */
#define SYSCON_SYSRSTSTAT_BOD                 (1 << 3)  /* Status of Brown-out detect reset */
#define SYSCON_SYSRSTSTAT_SYSRST              (1 << 4)  /* Status of the software system reset */
                                                        /* Bits 5-31: Reserved */

#define SYSCON_SYSPLLCLKSEL_SHIFT             (0) /* Bits 0-1: System PLL clock source */
#define SYSCON_SYSPLLCLKSEL_MASK              (3 << SYSCON_SYSPLLCLKSEL_SHIFT)
#  define SYSCON_SYSPLLCLKSEL_IRCOSC          (0 << SYSCON_SYSPLLCLKSEL_SHIFT)
#  define SYSCON_SYSPLLCLKSEL_SYSOSC          (1 << SYSCON_SYSPLLCLKSEL_SHIFT)
                                                                               /* Bits 2-31: Reserved */

#define SYSCON_SYSPLLCLKUEN_ENA               (1 << 0)  /* Bit 0: Enable system PLL clock source update */
                                                        /* Bits 1-31: Reserved */

