apache/nuttx/arch/arm/src/lpc11xx/hardware/lpc11_syscon.h
#define SYSCON_MAINCLKSEL_SHIFT               (0)       /* Bits 0-1: Clock source for main clock */
#define SYSCON_MAINCLKSEL_MASK                (3 << SYSCON_MAINCLKSEL_SHIFT)
#  define SYSCON_MAINCLKSEL_IRCOSC            (0 << SYSCON_MAINCLKSEL_SHIFT) /* IRC oscillator */
#  define SYSCON_MAINCLKSEL_PLLOSC            (1 << SYSCON_MAINCLKSEL_SHIFT) /* Input clock to system PLL */
#  define SYSCON_MAINCLKSEL_WDTOSC            (2 << SYSCON_MAINCLKSEL_SHIFT) /* WDT oscillator */
#  define SYSCON_MAINCLKSEL_SYSPLLCLKOUT      (3 << SYSCON_MAINCLKSEL_SHIFT) /* System PLL clock out */
                                                                             /* Bits 2-31: Reserved */

#define SYSCON_MAINCLKUEN_ENA                 (1 << 0)  /* Bit 0: Enable main clock source update */
                                                        /* Bits 1-31: Reserved */

#define SYSCON_SYSAHBCLKDIV_SHIFT             (0)       /* Bits 0-7: 0=System clock disabled, 1=Divide by 1 ... 255 = Divide by 255 */
#define SYSCON_SYSAHBCLKDIV_MASK              (0xff << SYSCON_SYSAHBCLKDIV_SHIFT)
                                                        /* Bits 8-31: Reserved */
//#  define SYSCON_CCLKCFG_DIV(n)       ((n-1) << SYSCON_CCLKCFG_SHIFT) /* n=2,3,..255 */

#define SYSCON_SYSAHBCLKCTRL_SYS              (1 << 0)  /* Bit 0:  Enables clock for AHB to APB bridge */
#define SYSCON_SYSAHBCLKCTRL_ROM              (1 << 1)  /* Bit 1:  Enables clock for ROM */
#define SYSCON_SYSAHBCLKCTRL_RAM              (1 << 2)  /* Bit 2:  Enables clock for RAM */
#define SYSCON_SYSAHBCLKCTRL_FLASHREG         (1 << 3)  /* Bit 3:  Enables clock for flash register interface */
#define SYSCON_SYSAHBCLKCTRL_FLASHARRAY       (1 << 4)  /* Bit 4:  Enables clock for flash array access */
#define SYSCON_SYSAHBCLKCTRL_I2C0             (1 << 5)  /* Bit 5:  Enables clock for I2C0 */
#define SYSCON_SYSAHBCLKCTRL_GPIO             (1 << 6)  /* Bit 6:  Enables clock for GPIO */
#define SYSCON_SYSAHBCLKCTRL_CT16B0           (1 << 7)  /* Bit 7:  Enables clock for 16-bit counter/timer 0 */
#define SYSCON_SYSAHBCLKCTRL_CT16B1           (1 << 8)  /* Bit 8:  Enables clock for 16-bit counter/timer 1 */
#define SYSCON_SYSAHBCLKCTRL_CT32B0           (1 << 9)  /* Bit 9:  Enables clock for 32-bit counter/timer 0 */
#define SYSCON_SYSAHBCLKCTRL_CT32B1           (1 << 10) /* Bit 10: Enables clock for 32-bit counter/timer 1 */
#define SYSCON_SYSAHBCLKCTRL_SSP0             (1 << 11) /* Bit 11: Enables clock for SPI0 */
#define SYSCON_SYSAHBCLKCTRL_UART             (1 << 12) /* Bit 12: Enables clock for UART */
#define SYSCON_SYSAHBCLKCTRL_ADC              (1 << 13) /* Bit 13: Enables clock for ADC */
                                                        /* Bit 14: Reserved */
#define SYSCON_SYSAHBCLKCTRL_WDT              (1 << 15) /* Bit 15: Enables clock for WDT */
#define SYSCON_SYSAHBCLKCTRL_IOCON            (1 << 16) /* Bit 16: Enables clock for I/O configuration block */
#define SYSCON_SYSAHBCLKCTRL_CAN              (1 << 17) /* Bit 17: Enables clock for C_CAN */
#define SYSCON_SYSAHBCLKCTRL_SSP1             (1 << 18) /* Bit 18: Enables clock for SPI1 */
                                                        /* Bits 19-31: Reserved */

#define SYSCON_SSP0CLKDIV_MASK                (0xff)    /* Bits 0-7: 0=Disable SPI0_PCLK, 1=Divide by 1 ... 255 = Divide by 255 */
                                                        /* Bits 8-31: Reserved */

#define SYSCON_UARTCLKDIV_MASK                (0xff)    /* Bits 0-7: 0=Disable UART_PCLK, 1=Divide by 1 ... 255 = Divide by 255 */
                                                        /* Bits 8-31: Reserved */

#define SYSCON_SSP1CLKDIV_MASK                (0xff)    /* Bits 0-7: 0=Disable SPI1_PCLK, 1=Divide by 1 ... 255 = Divide by 255 */
                                                        /* Bits 8-31: Reserved */

#define SYSCON_WDTCLKSEL_SHIFT                (0)       /* Bits 0-1: WDT clock source */
#define SYSCON_WDTCLKSEL_MASK                 (3 << SYSCON_WDTCLKSEL_SHIFT)
#  define SYSCON_WDTCLKSEL_IRCOSC             (0 << SYSCON_WDTCLKSEL_SHIFT) /* IRC oscillator */
#  define SYSCON_WDTCLKSEL_MAINCLK            (1 << SYSCON_WDTCLKSEL_SHIFT) /* Main clock */
#  define SYSCON_WDTCLKSEL_WDTOSC             (2 << SYSCON_WDTCLKSEL_SHIFT) /* Watchdog oscillator */
                                                                            /* Bits 2-31: reserved */

#define SYSCON_WDTCLKUEN_ENA                  (1 << 0)  /* Bit 0: Enable WDT clock source update */
                                                        /* Bits 1-31: Reserved */

#define SYSCON_WDTCLKDIV_MASK                 (0xff)    /* Bits 0-7: 0=Disable WDCLK, 1=Divide by 1 ... 255 = Divide by 255 */
                                                        /* Bits 8-31: Reserved */

#define SYSCON_CLKOUTCLKSEL_SHIFT             (0) /* Bits 0-1: CLKOUT clock source */
#define SYSCON_CLKOUTCLKSEL_MASK              (3 << SYSCON_CLKOUTCLKSEL_SHIFT)
#  define SYSCON_CLKOUTCLKSEL_IRCOSC          (0 << SYSCON_CLKOUTCLKSEL_SHIFT) /* IRC oscillator */
#  define SYSCON_CLKOUTCLKSEL_SYSOSC          (1 << SYSCON_CLKOUTCLKSEL_SHIFT) /* System oscillator */
#  define SYSCON_CLKOUTCLKSEL_WDTOSC          (2 << SYSCON_CLKOUTCLKSEL_SHIFT) /* Watchdog oscillator */
#  define SYSCON_CLKOUTCLKSEL_MAINCLK         (3 << SYSCON_CLKOUTCLKSEL_SHIFT) /* Main clock */
                                                                               /* Bits 2-31: Reserved */

#define SYSCON_CLKOUTUEN_ENA                  (1 << 0)  /* Bit 0: Enable CLKOUT clock source update */
                                                        /* Bits 1-31: Reserved */

#define SYSCON_CLKOUTCLKDIV_MASK              (0xff)    /* Bits 0-7: 0=Disable CLKOUT, 1=Divide by 1 ... 255 = Divide by 255 */
                                                        /* Bits 1-31: Reserved */

#define SYSCON_PIOPORCAP0_CAPPIO0_SHIFT       (0)       /* Bits 0-11: Raw reset stats input PIO0_n: PIO0_11 to PIO0_0 */
#define SYSCON_PIOPORCAP0_CAPPIO0_MASK        (0xfff << SYSCON_PIOPORCAP0_CAPPIO0_SHIFT)
#  define SYSCON_PIOPORCAP0_CAPPIO0_BIT(n)    ((1 << n) << SYSCON_PIOPORCAP0_CAPPIO0_SHIFT) /* n = 0 to 11 */

#define SYSCON_PIOPORCAP0_CAPPIO1_SHIFT       (12)      /* Bits 12-23: Raw reset stats input PIO0_n: PIO1_11 to PIO1_0 */
#define SYSCON_PIOPORCAP0_CAPPIO1_MASK        (0xfff << SYSCON_PIOPORCAP0_CAPPIO1_SHIFT)
#  define SYSCON_PIOPORCAP0_CAPPIO1_BIT(n)    ((1 << n) << SYSCON_PIOPORCAP0_CAPPIO1_SHIFT) /* n = 0 to 11 */

#define SYSCON_PIOPORCAP0_CAPPIO2_SHIFT       (24)      /* Bits 24-31: Raw reset stats input PIO0_n: PIO2_11 to PIO2_0 */
#define SYSCON_PIOPORCAP0_CAPPIO2_MASK        (0xfff << SYSCON_PIOPORCAP0_CAPPIO2_SHIFT)
#  define SYSCON_PIOPORCAP0_CAPPIO2_BIT(n)    ((1 << n) << SYSCON_PIOPORCAP0_CAPPIO2_SHIFT) /* n = 0 to 11 */


