apache/nuttx/arch/arm/src/lpc11xx/hardware/lpc11_syscon.h
#define SYSCON_PIOPORCAP1_CAPPIO2_8           (1 << 0)  /* Bit 0: Raw reset status input PIO2_8 */
#define SYSCON_PIOPORCAP1_CAPPIO2_9           (1 << 1)  /* Bit 1: Raw reset status input PIO2_9 */
#define SYSCON_PIOPORCAP1_CAPPIO2_10          (1 << 2)  /* Bit 2: Raw reset status input PIO2_10 */
#define SYSCON_PIOPORCAP1_CAPPIO2_11          (1 << 3)  /* Bit 3: Raw reset status input PIO2_11 */
#define SYSCON_PIOPORCAP1_CAPPIO3_0           (1 << 4)  /* Bit 4: Raw reset status input PIO3_0 */
#define SYSCON_PIOPORCAP1_CAPPIO3_1           (1 << 5)  /* Bit 5: Raw reset status input PIO3_1 */
#define SYSCON_PIOPORCAP1_CAPPIO3_2           (1 << 6)  /* Bit 6: Raw reset status input PIO3_2 */
#define SYSCON_PIOPORCAP1_CAPPIO3_3           (1 << 7)  /* Bit 7: Raw reset status input PIO3_3 */
#define SYSCON_PIOPORCAP1_CAPPIO3_4           (1 << 8)  /* Bit 8: Raw reset status input PIO3_4 */
#define SYSCON_PIOPORCAP1_CAPPIO3_5           (1 << 9)  /* Bit 9: Raw reset status input PIO3_5 */
                                                        /* Bits 10-31: Reserved */

#define SYSCON_BODCTRL_BODRSTLEV_SHIFT        (0)       /* Bits 0-1: BOD reset level */
#define SYSCON_BODCTRL_BODRSTLEV_MASK         (3 << SYSCON_BODCTRL_BODRSTLEV_SHIFT)
#  define SYSCON_BODCTRL_BODRSTLEV_LEVEL0     (0 << SYSCON_BODCTRL_BODRSTLEV_SHIFT) /* Level 0: assert 1.46V, de-assert 1.63V */
#  define SYSCON_BODCTRL_BODRSTLEV_LEVEL1     (1 << SYSCON_BODCTRL_BODRSTLEV_SHIFT) /* Level 1: assert 2.06V, de-assert 2.15V */
#  define SYSCON_BODCTRL_BODRSTLEV_LEVEL2     (2 << SYSCON_BODCTRL_BODRSTLEV_SHIFT) /* Level 2: assert 2.35V, de-assert 2.43V */
#  define SYSCON_BODCTRL_BODRSTLEV_LEVEL3     (3 << SYSCON_BODCTRL_BODRSTLEV_SHIFT) /* Level 3: assert 2.63V, de-assert 2.71V */
#define SYSCON_BODCTRL_BODINTVAL_SHIFT        (2)       /* Bits 2-3: BOD interrupt level */
#define SYSCON_BODCTRL_BODINTVAL_MASK         (3 << SYSCON_BODCTRL_BODRSTLEV_BODINTVAL_SHIFT)
#  define SYSCON_BODCTRL_BODINTVAL_LEVEL0     (0 << SYSCON_BODCTRL_BODINTVAL_SHIFT) /* Level 0: Reserved */
#  define SYSCON_BODCTRL_BODINTVAL_LEVEL1     (1 << SYSCON_BODCTRL_BODINTVAL_SHIFT) /* Level 1: int. assert 2.22V,de-a. 2.35V */
#  define SYSCON_BODCTRL_BODINTVAL_LEVEL2     (2 << SYSCON_BODCTRL_BODINTVAL_SHIFT) /* Level 2: int. assert 2.52V,de-a. 2.66V */
#  define SYSCON_BODCTRL_BODINTVAL_LEVEL3     (3 << SYSCON_BODCTRL_BODINTVAL_SHIFT) /* Level 3: int. assert 2.80V,de-a. 2.90V */
#define SYSCON_BODCTRL_BODRSTENA              (1 << 4)  /* BOD reset enable */
                                                        /* Bits 5-31: Reserved */

#define SYSCON_SYSTCKCAL_CAL                  0x3ffffff /* Bits 0-25: System tick timer calibration value */
                                                        /* Bits 26-31: Reserved */

#define SYSCON_IRQLATENCY_LATENCY_MASK        (0xff)    /* Bits 0-7: 8-bit latency value */
                                                        /* Bits 8-31: Reserved */

#define SYSCON_NMISRC_IRQNO_SHIFT             (0)       /* Bits 0-4: The IRQ number of interrupt that acts as NMI if bit 31 is 1 */
#define SYSCON_NMISRC_IRQNO_MASK              (31 << SYSCON_NMISRC_IRQNO_SHIFT)
                                                        /* Bits 5-30: Reserved */
#define SYSCON_NMISRC_NMIEN                   (1 << 31) /* Write 1 to this bit to enable NMI source selected by bits 4:0 */

#define SYSCON_STARTAPRP0_APRPIO0_SHIFT       (0)       /* Bits 0-11: Edge select for start logic input PIO0_[0-11], 0=fall/1=rise */
#define SYSCON_STARTAPRP0_APRPIO0_MASK        (0xfff << SYSCON_STARTAPRP0_APRPIO0_SHIFT)
#  define SYSCON_STARTAPRP0_APRPIO0_BIT(n)    ((1 << n) << SYSCON_STARTAPRP0_APRPIO0_SHIFT) /* n = 0 to 11 */
#define SYSCON_STARTAPRP0_APRPIO1_0           (1 << 12) /* Bit 12: Edge select start logic input PIO1_0, 0=falling/1=rising */
                                                        /* Bits 13-31: Reserved */

#define SYSCON_STARTERP0_ERPIO0_SHIFT         (0)       /* Bits 0-11: Enable start signal for start logic input PIO0[0-11] */
#define SYSCON_STARTERP0_ERPIO0_MASK          (0xfff << SYSCON_STARTERP0_ERPIO0_SHIFT)
#  define SYSCON_STARTERP0_ERPIO0_BIT(n)      ((1 << n) << SYSCON_STARTERP0_ERPIO0_SHIFT) /* n = 0 to 11 */
#define SYSCON_STARTERP0_ERPIO1_0             (1 << 12) /* Bit 12: Enable start signal for start logic input PIO1_0 */
                                                        /* Bits 13-31: Reserved */

#define SYSCON_STARTRSRP0CLR_RSRPIO0_SHIFT    (0)       /* Bits 0-11: Start logic reset register 0 */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_MASK     (0xfff << SYSCON_STARTRSRP0CLR_RSRPIO0_SHIFT)
#  define SYSCON_STARTRSRP0CLR_RSRPIO0_BIT(n) ((1 << n) << SYSCON_STARTRSRP0CLR_RSRPIO0_SHIFT) /* n = 0 to 11 */
#define SYSCON_STARTRSRP0CLR_RSRPIO1_0        (1 << 12) /* Bit 12: Start signal reset for start logic input PIO1_0 */
                                                        /* Bits 13-31: Reserved */

#define SYSCON_STARTSRP0_SRPIO0_SHIFT         (0)       /* Bits 0-11: Start logic status register 0 */
#define SYSCON_STARTSRP0_SRPIO0_MASK          (0xfff << SYSCON_STARTSRP0_SRPIO0_SHIFT)
#  define SYSCON_STARTSRP0_SRPIO0_BIT(n)      ((1 << n) << SYSCON_STARTSRP0_SRPIO0_SHIFT) /* n = 0 to 11 */
#define SYSCON_STARTSRP0_SRPIO1_0             (1 << 12) /* Bit 12: Start signal status for start logic input PIO1_0 */
                                                        /* Bits 13-31: Reserved */

                                                        /* Bits 0-2: Reserved. NOTE: Always write these bits as 111 */
#define SYSCON_PDSLEEPCFG_BOD_PD              (1 << 3)  /* BOD power-down control in Deep-sleep mode */
                                                        /* Bits 4-5: Reserved. NOTE: Always write these bits as 11 */
#define SYSCON_PDSLEEPCFG_WDTOSC_PD           (1 << 6)  /* Watchdog oscillator power control in Deep-sleep mode */
                                                        /* Bit 7:  Reserved. NOTE: Always write this bit as 1 */
                                                        /* Bits 8-10: Reserved NOTE: Always write these bits as 000 */
                                                        /* Bits 11-12: Reserved. NOTE: Always write these bits as 11 */
                                                        /* Bits 13-31: Reserved */

#define SYSCON_PDAWAKECFG_IRCOUT_PD           (1 << 0)  /* Bit 0:  IRC oscillator output wake-up configuration */
#define SYSCON_PDAWAKECFG_IRC_PD              (1 << 1)  /* Bit 1:  IRC oscillator wake-up configuration */
#define SYSCON_PDAWAKECFG_FLASH_PD            (1 << 2)  /* Bit 2:  Flash wake-up configuration */
#define SYSCON_PDAWAKECFG_BOD_PD              (1 << 3)  /* Bit 3:  Brownout Detection wake-up configuration */
#define SYSCON_PDAWAKECFG_ADC_PD              (1 << 4)  /* Bit 4:  ADC wake-up configuration */
#define SYSCON_PDAWAKECFG_SYSOSC_PD           (1 << 5)  /* Bit 5:  System oscillator wake-up configuration */
#define SYSCON_PDAWAKECFG_WDTOSC_PD           (1 << 6)  /* Bit 6:  Watchdog oscillator wake-up configuration */
#define SYSCON_PDAWAKECFG_SYSPLL_PD           (1 << 7)  /* Bit 7:  System PLL wake-up configuration */
                                                        /* Bit 8:  Reserved. NOTE: Always write this bit as 1 */
                                                        /* Bit 9:  Reserved. NOTE: Always write this bit as 0 */
                                                        /* Bit 10: Reserved. NOTE: Always write this bit as 1 */
                                                        /* Bit 11: Reserved. NOTE: Always write this bit as 1 */
                                                        /* Bit 12: Reserved. NOTE: Always write this bit as 0 */
                                                        /* Bits 13-15: Reserved. NOTE: Always write these bits as 111 */
                                                        /* Bits 16-31: Reserved */

#define SYSCON_PDRUNCFG_IRCOUT_PD             (1 << 0)  /* Bit 0:  IRC oscillator output power-down */
#define SYSCON_PDRUNCFG_IRC_PD                (1 << 1)  /* Bit 1:  IRC oscillator power-down */
#define SYSCON_PDRUNCFG_FLASH_PD              (1 << 2)  /* Bit 2:  Flash power-down */
#define SYSCON_PDRUNCFG_BOD_PD                (1 << 3)  /* Bit 3:  Brownout Detection power-down */
#define SYSCON_PDRUNCFG_ADC_PD                (1 << 4)  /* Bit 4:  ADC power-down */
#define SYSCON_PDRUNCFG_SYSOSC_PD             (1 << 5)  /* Bit 5:  System oscillator power-down */
#define SYSCON_PDRUNCFG_WDTOSC_PD             (1 << 6)  /* Bit 6:  Watchdog oscillator power-down */
#define SYSCON_PDRUNCFG_SYSPLL_PD             (1 << 7)  /* Bit 7:  System PLL power-down */
                                                        /* Bit 8:  Reserved. NOTE: Always write this bit as 1 */
                                                        /* Bit 9:  Reserved. NOTE: Always write this bit as 0 */
                                                        /* Bit 10: Reserved. NOTE: Always write this bit as 1 */
                                                        /* Bit 11: Reserved. NOTE: Always write this bit as 1 */
                                                        /* Bit 12: Reserved. NOTE: Always write this bit as 0 */
                                                        /* Bits 13-15: Reserved. NOTE: Always write these bits as 111 */
                                                        /* Bits 16-31: Reserved */

/********************************************************************************************
 * Public Types
 ********************************************************************************************/

/********************************************************************************************
 * Public Data
 ********************************************************************************************/

/********************************************************************************************
 * Public Functions
 ********************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC11XX_HARDWARE_LPC11_SYSCON_H */
